<!-- это другой лейаут если надо несколько и тд можно выберать на странице
 если нечего не делать подставится дефолтный если указать то указынный (зайди в info.vue) -->
<script setup>

</script>

<template>
    <!-- Тут название или же можешь вообше его не писать тут по желанию -->
    <h1>any Layout</h1>
    <NuxtLink to="/info">перейти в info </NuxtLink> <br />
    <NuxtLink to="/"> Главное</NuxtLink>

    <!-- сюда по факту будуь подставлятся все что мы обернули в NuxtLayout (зайди в App.vue) -->
    <slot /> 
</template>

<style scoped>

</style>